console.log("Лабораторна робота #13: Особливості ініціалізації змінних Javascript");

console.log("Завдання 1: Аналіз hoisting");
//Передбачте результат виконання, потім запустіть код та поясніть в коментарі коментар.

console.log("Завдання 2: Робота з областю видимості (scope)");
//Передбачте, які змінні будуть доступні після if-блоку. Додайте відповідний коментар.

console.log("Завдання 3: Робота з типами даних");
//Передбачте результати виконання коду, запустіть код та поясніть його. Додайте відповідний коментар.

console.log("Завдання 4: const та об'єкти");
//Передбачте результати виконання коду, запустіть код та поясніть його. Додайте відповідний коментар.

console.log("Завдання 5: Визначення типу даних");
//Передбачте результати виконання коду, запустіть код та поясніть його. Додайте відповідний коментар.
