console.log("Лабораторна робота #13: Робота з функціями");

console.log("Завдання 1: Реалізуйте функцію findMax(a, b), яка знаходить максимальне з двох чисел.");

console.log("Завдання 2: Реалізуйте функціональний вираз subtract(a, b), який віднімає b від a.");

console.log("Завдання 3: Реалізуйте стрілкову функцію sqrt(n), яка обчислює квадратний корінь з n.");

console.log("Завдання 4: Реалізуйте рекурсивну функцію geometricProgression(n, a, r), яка обчислює суму перших n членів ряду:");

console.log("Завдання 5: Реалізуйте функцію-замикання createDivider(divisor), яка створює дільник для переданого числа.");

console.log("Завдання 6: Реалізуйте функцію applyOperation(a, b, func), яка приймає два числа та функцію для їхньої обробки. Наведіть приклад для додавання і множення.");

console.log("Завдання 7*: Реалізуйте функцію processSet(set, callback), яка застосовує колбек до всіх елементів множини Set.");